InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Сертификаты</v8:Type>
						<v8:Type>cfg:DocumentRef.НакладнаяНаДоставку</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Штрихкоды/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
                  
	Если Количество() Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Если Не Константы.РазрешитьНеуникальныеШтрихкоды.Получить() Тогда
		
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	НаборЗаписей.Штрихкод,
			                      |	НаборЗаписей.Владелец
			                      |ПОМЕСТИТЬ НаборЗаписей
			                      |ИЗ
			                      |	&НаборЗаписей КАК НаборЗаписей
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	Штрихкоды.Штрихкод,
			                      |	Штрихкоды.Владелец
			                      |ИЗ
			                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
			                      |ГДЕ
			                      |	Штрихкоды.Штрихкод В(&НаборЗаписей)
			                      |	И НЕ (Штрихкоды.Штрихкод, Штрихкоды.Владелец) В (&НаборЗаписей)
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |УНИЧТОЖИТЬ НаборЗаписей");
			Запрос.УстановитьПараметр("НаборЗаписей", Выгрузить( , "Штрихкод,Владелец"));
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				// TODO: Регистрация ошибки.
				ТекстСообщения = Шаблон(НСтр("ru = 'Штрих-код [Код] принадлежит элементу [Ссылка]'; uk = 'Штрих-код [Код] належить елементу [Ссылка]'"),
					Новый Структура("Код,Ссылка", Кавычки(СокрП(Выборка.Штрихкод)), Кавычки(Выборка.Владелец)));
				__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ТекстСообщения, , "Штрихкод", "Штрихкод", Отказ);
			КонецЕсли; 	
			
		КонецЕсли; 
	
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
